Sysbench Test Stuff/mysql_tests/sql16.txt
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 16

Doing OLTP test.
Running mixed OLTP test
Doing read-only test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 15 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            159180
        write:                           0
        other:                           22740
        total:                           181920
    transactions:                        11370  (189.35 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 159180 (2650.87 per sec.)
    other operations:                    22740  (378.70 per sec.)

Test execution summary:
    total time:                          60.0482s
    total number of events:              11370
    total time taken by event execution: 960.0523
    per-request statistics:
         min:                                 11.36ms
         avg:                                 84.44ms
         max:                                200.26ms
         approx.  95 percentile:             124.95ms

Threads fairness:
    events (avg/stddev):           710.6250/18.80
    execution time (avg/stddev):   60.0033/0.01

sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 16

Doing OLTP test.
Running mixed OLTP test
Doing read-only test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 15 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            144144
        write:                           0
        other:                           20592
        total:                           164736
    transactions:                        10296  (171.47 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 144144 (2400.57 per sec.)
    other operations:                    20592  (342.94 per sec.)

Test execution summary:
    total time:                          60.0458s
    total number of events:              10296
    total time taken by event execution: 960.1132
    per-request statistics:
         min:                                 17.86ms
         avg:                                 93.25ms
         max:                                190.43ms
         approx.  95 percentile:             134.38ms

Threads fairness:
    events (avg/stddev):           643.5000/8.20
    execution time (avg/stddev):   60.0071/0.01

sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 16

Doing OLTP test.
Running mixed OLTP test
Doing read-only test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 15 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            140084
        write:                           0
        other:                           20012
        total:                           160096
    transactions:                        10006  (166.57 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 140084 (2331.96 per sec.)
    other operations:                    20012  (333.14 per sec.)

Test execution summary:
    total time:                          60.0714s
    total number of events:              10006
    total time taken by event execution: 960.3406
    per-request statistics:
         min:                                 19.66ms
         avg:                                 95.98ms
         max:                                193.37ms
         approx.  95 percentile:             138.79ms

Threads fairness:
    events (avg/stddev):           625.3750/6.54
    execution time (avg/stddev):   60.0213/0.02